<?php
namespace app\api;

use think\Controller;

class constant extends Controller{
    public function index(){
        return [
            "project_type_map" => [
                    "None"        => 0,
                    "房屋建筑工程"  => 1,
                    "市政工程"     => 2,
                    "其他"        => 3,
                ],
            "project_nature_map" => [
                "None"=> 0,
                "新建" => 1,
                "改建" => 2,
                "其他" => 3,
                "迁建" => 4,
                "扩建" => 5,
                "恢复" => 6,
            ],
            "project_use_map" => [
                "None"           => 0,
                "道路"            => 1,
                "其他"            => 2,
                "工业建筑"         => 3,
                "居住建筑"         => 4,
                "商住楼"           => 5,
                "公共建筑"         => 6,
                "科教文卫建筑"      => 7,
                "桥隧"             => 8,
                "交通运输类"        => 9,
                "办公建筑"          => 10,
                "公共交通"          => 11,
                "农业建筑"          => 12,
                "商业建筑"          => 13,
                "排水"             => 14,
                "风景园林"          => 15,
                "给水"              => 16,
                "居住建筑配套工程"    => 17,
                "工业建筑配套工程"    => 18,
                "公共建筑配套工程"    => 19,
                "燃气"              => 20,
                "旅游建筑"          => 21,
                "热力"             => 22,
                "环境园林"          => 23,
                "农业建筑配套工程"    => 24,
                "通信建筑"          => 25,
            ],
            "project_level_map" => [
                "None"    => 0,
                "地市级"   => 1,
                "区县级"   => 2,
                "部级"     => 3,
                "省级"     => 4,
            ],
            "bid_type_map" => [
                "None"           => 0,
                "施工"            => 1,
                "设计"            => 2,
                "勘察"            => 3,
                "监理"            => 4,
                "工程总承包"       => 5,
                "设计施工一体化"    => 6,
                "其他"            => 7,
            ],
            "bid_way_map" => [
                "None"     => 0,
                "公开招标"  => 1,
                "邀请招标"  => 2,
                "直接委托"  => 3,
                "其他"     => 4,
            ],
            "contract_type_map" => [
                "None"       => 0,
                "施工总包"     => 1,
                "监理"        => 2,
                "设计"        => 3,
                "勘察"        => 4,
                "施工分包"     => 5,
                "工程总承包"    => 6,
                "专业承包"      => 7,
                "施工劳务"      => 8,
                "项目管理"      => 9,
                "设计施工一体化" => 10,

            ],
        ];
    }
}
?>